create_clock -period 20.000 -name clk_50M -waveform {0.000 10.000} [get_ports clk_50M]
create_clock -period 90.422 -name clk_11M0592 -waveform {0.000 45.211} [get_ports clk_11M0592]

set all_mmcm_clk   [get_clocks -of_objects [get_pins clock_gen/inst/mmcm_adv_inst/CLKOUT*]]
set sram_clk       [get_clocks clk_out2_pll_example]
set vga_clk        [get_clocks clk_50M]
set main_clk       [get_clocks clk_out1_pll_example]
set peripheral_clk [get_clocks clk_out2_pll_example]

set_false_path -from $vga_clk               -to $all_mmcm_clk
set_false_path -from $all_mmcm_clk          -to $vga_clk
set_false_path -from $peripheral_clk        -to $main_clk
set_false_path -from [get_pins rst_reg_*/*] -to *

set_input_delay  -clock $sram_clk -min -add_delay 8.000  [get_ports {base_ram_data[*]}]
set_input_delay  -clock $sram_clk -max -add_delay 10.000 [get_ports {base_ram_data[*]}]
set_input_delay  -clock $sram_clk -min -add_delay 8.000  [get_ports {ext_ram_data[*]}]
set_input_delay  -clock $sram_clk -max -add_delay 10.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_addr[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_addr[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_be_n[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_be_n[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_data[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_data[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_addr[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_addr[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_be_n[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_be_n[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_data[*]}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_ce_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_ce_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_oe_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_oe_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {base_ram_we_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {base_ram_we_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_ce_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_ce_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_oe_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_oe_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {ext_ram_we_n}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {ext_ram_we_n}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {uart_wrn}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {uart_wrn}]
set_output_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {uart_rdn}]
set_output_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {uart_rdn}]
set_input_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {uart_dataready}]
set_input_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {uart_dataready}]
set_input_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {uart_tsre}]
set_input_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {uart_tsre}]
set_input_delay -clock $sram_clk -min -add_delay 0.000 [get_ports {uart_tbre}]
set_input_delay -clock $sram_clk -max -add_delay 8.000 [get_ports {uart_tbre}]